Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA202.h
#define SPI1BUFH SPI1BUFH
extern volatile unsigned int  SPI1BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFHBITS {
  union {
    struct {
      unsigned SPI1BUFH:16;
    };
    struct {
      unsigned DATA:16;
    };
  };
} SPI1BUFHBITS;
extern volatile SPI1BUFHBITS SPI1BUFHbits __attribute__((__sfr__));

#define SPI1BRGL SPI1BRGL
extern volatile unsigned int  SPI1BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BRGLBITS {
  union {
    struct {
      unsigned SPI1BRGL:13;
    };
    struct {
      unsigned BRG:13;
    };
  };
} SPI1BRGLBITS;
extern volatile SPI1BRGLBITS SPI1BRGLbits __attribute__((__sfr__));

#define SPI1BRGH SPI1BRGH
extern volatile unsigned int  SPI1BRGH __attribute__((__sfr__));
#define SPI1IMSK1 SPI1IMSK1
extern volatile unsigned int  SPI1IMSK1 __attribute__((__sfr__));
typedef struct tagSPI1IMSK1BITS {
  unsigned SPIRBFEN:1;
  unsigned SPITBFEN:1;
  unsigned :1;
  unsigned SPITBEN:1;
  unsigned :1;
  unsigned SPIRBEN:1;
  unsigned SPIROVEN:1;
  unsigned SRMTEN:1;
  unsigned SPITUREN:1;
  unsigned :2;
  unsigned BUSYEN:1;
  unsigned FRMERREN:1;
} SPI1IMSK1BITS;
extern volatile SPI1IMSK1BITS SPI1IMSK1bits __attribute__((__sfr__));

#define SPI1IMSKL SPI1IMSKL
extern volatile unsigned int  SPI1IMSKL __attribute__((__sfr__));
typedef struct tagSPI1IMSKLBITS {
  unsigned SPIRBFEN:1;
  unsigned SPITBFEN:1;
  unsigned :1;
  unsigned SPITBEN:1;
  unsigned :1;
  unsigned SPIRBEN:1;
  unsigned SPIROVEN:1;
  unsigned SRMTEN:1;
  unsigned SPITUREN:1;
  unsigned :2;
  unsigned BUSYEN:1;
  unsigned FRMERREN:1;
} SPI1IMSKLBITS;
extern volatile SPI1IMSKLBITS SPI1IMSKLbits __attribute__((__sfr__));

#define SPI1IMSK2 SPI1IMSK2
extern volatile unsigned int  SPI1IMSK2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1IMSK2BITS {
  union {
    struct {
      unsigned TXMSK:6;
      unsigned :1;
      unsigned TXWIEN:1;
      unsigned RXMSK:6;
      unsigned :1;
      unsigned RXWIEN:1;
    };
    struct {
      unsigned TXMSK0:1;
      unsigned TXMSK1:1;
      unsigned TXMSK2:1;
      unsigned TXMSK3:1;
      unsigned TXMSK4:1;
      unsigned TXMSK5:1;
      unsigned :2;
      unsigned RXMSK0:1;
      unsigned RXMSK1:1;
      unsigned RXMSK2:1;
      unsigned RXMSK3:1;
      unsigned RXMSK4:1;
      unsigned RXMSK5:1;
    };
  };
} SPI1IMSK2BITS;
extern volatile SPI1IMSK2BITS SPI1IMSK2bits __attribute__((__sfr__));

#define SPI1IMSKH SPI1IMSKH
extern volatile unsigned int  SPI1IMSKH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1IMSKHBITS {
  union {
    struct {
      unsigned TXMSK:6;
      unsigned :1;
      unsigned TXWIEN:1;
      unsigned RXMSK:6;
      unsigned :1;
      unsigned RXWIEN:1;
    };
    struct {
      unsigned TXMSK0:1;
      unsigned TXMSK1:1;
      unsigned TXMSK2:1;
      unsigned TXMSK3:1;
      unsigned TXMSK4:1;
      unsigned TXMSK5:1;
      unsigned :2;
      unsigned RXMSK0:1;
      unsigned RXMSK1:1;
      unsigned RXMSK2:1;
      unsigned RXMSK3:1;
      unsigned RXMSK4:1;
      unsigned RXMSK5:1;
    };
  };
} SPI1IMSKHBITS;
extern volatile SPI1IMSKHBITS SPI1IMSKHbits __attribute__((__sfr__));

#define SPI1URDTL SPI1URDTL
extern volatile unsigned int  SPI1URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1URDTLBITS {
  union {
    struct {
      unsigned SPI1URDTL:16;
    };
    struct {
      unsigned URDATA:16;
    };
  };
} SPI1URDTLBITS;
extern volatile SPI1URDTLBITS SPI1URDTLbits __attribute__((__sfr__));

#define SPI1URDTH SPI1URDTH
extern volatile unsigned int  SPI1URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1URDTHBITS {
  union {
    struct {
      unsigned SPI1URDTH:16;
    };
    struct {
      unsigned URDATA:16;
    };
  };
} SPI1URDTHBITS;
extern volatile SPI1URDTHBITS SPI1URDTHbits __attribute__((__sfr__));

#define SPI2CON1 SPI2CON1
extern volatile unsigned int  SPI2CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1BITS {
  union {
    struct {
      unsigned ENHBUF:1;
      unsigned SPIFE:1;
      unsigned MCLKEN:1;
      unsigned DISSCK:1;
      unsigned DISSDI:1;
      unsigned MSTEN:1;
      unsigned CKP:1;
      unsigned SSEN:1;
      unsigned CKE:1;
      unsigned SMP:1;
      unsigned MODE16:1;
      unsigned MODE32:1;
      unsigned DISSDO:1;
      unsigned SPISIDL:1;
      unsigned :1;
      unsigned SPIEN:1;
    };
    struct {
      unsigned :10;
      unsigned MODE:2;
    };
  };
} SPI2CON1BITS;
extern volatile SPI2CON1BITS SPI2CON1bits __attribute__((__sfr__));

#define SPI2CON1L SPI2CON1L
extern volatile unsigned int  SPI2CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1LBITS {
  union {
    struct {
      unsigned ENHBUF:1;
      unsigned SPIFE:1;
      unsigned MCLKEN:1;
      unsigned DISSCK:1;
      unsigned DISSDI:1;
      unsigned MSTEN:1;
      unsigned CKP:1;
      unsigned SSEN:1;
      unsigned CKE:1;
      unsigned SMP:1;
      unsigned MODE16:1;
      unsigned MODE32:1;
      unsigned DISSDO:1;
      unsigned SPISIDL:1;
      unsigned :1;
      unsigned SPIEN:1;
    };
    struct {
      unsigned :10;
      unsigned MODE:2;
    };
  };
} SPI2CON1LBITS;
extern volatile SPI2CON1LBITS SPI2CON1Lbits __attribute__((__sfr__));

#define SPI2CON1H SPI2CON1H
extern volatile unsigned int  SPI2CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1HBITS {
  union {
    struct {
      unsigned FRMCNT:3;
      unsigned FRMSYPW:1;
      unsigned MSSEN:1;
      unsigned FRMPOL:1;
      unsigned FRMSYNC:1;
      unsigned FRMEN:1;
      unsigned AUDMOD:2;
      unsigned URDTEN:1;
      unsigned AUDMONO:1;
      unsigned IGNTUR:1;
      unsigned IGNROV:1;
      unsigned SPISGNEXT:1;
      unsigned AUDEN:1;
    };
    struct {
      unsigned FRMCNT0:1;
      unsigned FRMCNT1:1;
      unsigned FRMCNT2:1;
      unsigned :5;
      unsigned AUDMOD0:1;
      unsigned AUDMOD1:1;
    };
  };
} SPI2CON1HBITS;
extern volatile SPI2CON1HBITS SPI2CON1Hbits __attribute__((__sfr__));

#define SPI2CON2 SPI2CON2
extern volatile unsigned int  SPI2CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON2BITS {
  union {
    struct {
      unsigned FRMCNT:3;
      unsigned FRMSYPW:1;
      unsigned MSSEN:1;
      unsigned FRMPOL:1;
      unsigned FRMSYNC:1;
      unsigned FRMEN:1;
      unsigned AUDMOD:2;
      unsigned URDTEN:1;
      unsigned AUDMONO:1;
      unsigned IGNTUR:1;
      unsigned IGNROV:1;
      unsigned SPISGNEXT:1;
      unsigned AUDEN:1;
    };
    struct {
      unsigned FRMCNT0:1;
      unsigned FRMCNT1:1;
      unsigned FRMCNT2:1;
      unsigned :5;
      unsigned AUDMOD0:1;
      unsigned AUDMOD1:1;
    };
  };
} SPI2CON2BITS;
extern volatile SPI2CON2BITS SPI2CON2bits __attribute__((__sfr__));

#define SPI2CON2L SPI2CON2L
extern volatile unsigned int  SPI2CON2L __attribute__((__sfr__));
typedef struct tagSPI2CON2LBITS {
  unsigned WLENGTH:5;
} SPI2CON2LBITS;
extern volatile SPI2CON2LBITS SPI2CON2Lbits __attribute__((__sfr__));

#define SPI2CON3 SPI2CON3
extern volatile unsigned int  SPI2CON3 __attribute__((__sfr__));
typedef struct tagSPI2CON3BITS {
  unsigned WLENGTH:5;
} SPI2CON3BITS;
