Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA202.h
extern volatile SPI2CON3BITS SPI2CON3bits __attribute__((__sfr__));

#define SPI2CON2H SPI2CON2H
extern volatile unsigned int  SPI2CON2H __attribute__((__sfr__));
#define SPI2CON4 SPI2CON4
extern volatile unsigned int  SPI2CON4 __attribute__((__sfr__));
#define SPI2STATL SPI2STATL
extern volatile unsigned int  SPI2STATL __attribute__((__sfr__));
typedef struct tagSPI2STATLBITS {
  unsigned SPIRBF:1;
  unsigned SPITBF:1;
  unsigned :1;
  unsigned SPITBE:1;
  unsigned :1;
  unsigned SPIRBE:1;
  unsigned SPIROV:1;
  unsigned SRMT:1;
  unsigned SPITUR:1;
  unsigned :2;
  unsigned SPIBUSY:1;
  unsigned FRMERR:1;
} SPI2STATLBITS;
extern volatile SPI2STATLBITS SPI2STATLbits __attribute__((__sfr__));

#define SPI2STATH SPI2STATH
extern volatile unsigned int  SPI2STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2STATHBITS {
  union {
    struct {
      unsigned TXELM:6;
      unsigned :2;
      unsigned RXELM:6;
    };
    struct {
      unsigned TXELM0:1;
      unsigned TXELM1:1;
      unsigned TXELM2:1;
      unsigned TXELM3:1;
      unsigned TXELM4:1;
      unsigned TXELM5:1;
      unsigned :2;
      unsigned RXELM0:1;
      unsigned RXELM1:1;
      unsigned RXELM2:1;
      unsigned RXELM3:1;
      unsigned RXELM4:1;
      unsigned RXELM5:1;
    };
  };
} SPI2STATHBITS;
extern volatile SPI2STATHBITS SPI2STATHbits __attribute__((__sfr__));

#define SPI2BUFL SPI2BUFL
extern volatile unsigned int  SPI2BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI2BUFLBITS {
  union {
    struct {
      unsigned SPI2BUFL:16;
    };
    struct {
      unsigned DATA:16;
    };
  };
} SPI2BUFLBITS;
extern volatile SPI2BUFLBITS SPI2BUFLbits __attribute__((__sfr__));

#define SPI2BUFH SPI2BUFH
extern volatile unsigned int  SPI2BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2BUFHBITS {
  union {
    struct {
      unsigned SPI2BUFH:16;
    };
    struct {
      unsigned DATA:16;
    };
  };
} SPI2BUFHBITS;
extern volatile SPI2BUFHBITS SPI2BUFHbits __attribute__((__sfr__));

#define SPI2BRGL SPI2BRGL
extern volatile unsigned int  SPI2BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI2BRGLBITS {
  union {
    struct {
      unsigned SPI2BRGL:13;
    };
    struct {
      unsigned BRG:13;
    };
  };
} SPI2BRGLBITS;
extern volatile SPI2BRGLBITS SPI2BRGLbits __attribute__((__sfr__));

#define SPI2BRGH SPI2BRGH
extern volatile unsigned int  SPI2BRGH __attribute__((__sfr__));
#define SPI2IMSK1 SPI2IMSK1
extern volatile unsigned int  SPI2IMSK1 __attribute__((__sfr__));
typedef struct tagSPI2IMSK1BITS {
  unsigned SPIRBFEN:1;
  unsigned SPITBFEN:1;
  unsigned :1;
  unsigned SPITBEN:1;
  unsigned :1;
  unsigned SPIRBEN:1;
  unsigned SPIROVEN:1;
  unsigned SRMTEN:1;
  unsigned SPITUREN:1;
  unsigned :2;
  unsigned BUSYEN:1;
  unsigned FRMERREN:1;
} SPI2IMSK1BITS;
extern volatile SPI2IMSK1BITS SPI2IMSK1bits __attribute__((__sfr__));

#define SPI2IMSKL SPI2IMSKL
extern volatile unsigned int  SPI2IMSKL __attribute__((__sfr__));
typedef struct tagSPI2IMSKLBITS {
  unsigned SPIRBFEN:1;
  unsigned SPITBFEN:1;
  unsigned :1;
  unsigned SPITBEN:1;
  unsigned :1;
  unsigned SPIRBEN:1;
  unsigned SPIROVEN:1;
  unsigned SRMTEN:1;
  unsigned SPITUREN:1;
  unsigned :2;
  unsigned BUSYEN:1;
  unsigned FRMERREN:1;
} SPI2IMSKLBITS;
extern volatile SPI2IMSKLBITS SPI2IMSKLbits __attribute__((__sfr__));

#define SPI2IMSK2 SPI2IMSK2
extern volatile unsigned int  SPI2IMSK2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2IMSK2BITS {
  union {
    struct {
      unsigned TXMSK:6;
      unsigned :1;
      unsigned TXWIEN:1;
      unsigned RXMSK:6;
      unsigned :1;
      unsigned RXWIEN:1;
    };
    struct {
      unsigned TXMSK0:1;
      unsigned TXMSK1:1;
      unsigned TXMSK2:1;
      unsigned TXMSK3:1;
      unsigned TXMSK4:1;
      unsigned TXMSK5:1;
      unsigned :2;
      unsigned RXMSK0:1;
      unsigned RXMSK1:1;
      unsigned RXMSK2:1;
      unsigned RXMSK3:1;
      unsigned RXMSK4:1;
      unsigned RXMSK5:1;
    };
  };
} SPI2IMSK2BITS;
extern volatile SPI2IMSK2BITS SPI2IMSK2bits __attribute__((__sfr__));

#define SPI2IMSKH SPI2IMSKH
extern volatile unsigned int  SPI2IMSKH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2IMSKHBITS {
  union {
    struct {
      unsigned TXMSK:6;
      unsigned :1;
      unsigned TXWIEN:1;
      unsigned RXMSK:6;
      unsigned :1;
      unsigned RXWIEN:1;
    };
    struct {
      unsigned TXMSK0:1;
      unsigned TXMSK1:1;
      unsigned TXMSK2:1;
      unsigned TXMSK3:1;
      unsigned TXMSK4:1;
      unsigned TXMSK5:1;
      unsigned :2;
      unsigned RXMSK0:1;
      unsigned RXMSK1:1;
      unsigned RXMSK2:1;
      unsigned RXMSK3:1;
      unsigned RXMSK4:1;
      unsigned RXMSK5:1;
    };
  };
} SPI2IMSKHBITS;
extern volatile SPI2IMSKHBITS SPI2IMSKHbits __attribute__((__sfr__));

#define SPI2URDTL SPI2URDTL
extern volatile unsigned int  SPI2URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI2URDTLBITS {
  union {
    struct {
      unsigned SPI2URDTL:16;
    };
    struct {
      unsigned URDATA:16;
    };
  };
} SPI2URDTLBITS;
extern volatile SPI2URDTLBITS SPI2URDTLbits __attribute__((__sfr__));

#define SPI2URDTH SPI2URDTH
extern volatile unsigned int  SPI2URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2URDTHBITS {
  union {
    struct {
      unsigned SPI2URDTH:16;
    };
    struct {
      unsigned URDATA:16;
    };
  };
} SPI2URDTHBITS;
extern volatile SPI2URDTHBITS SPI2URDTHbits __attribute__((__sfr__));

#define SPI3CON1 SPI3CON1
extern volatile unsigned int  SPI3CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1BITS {
  union {
    struct {
      unsigned ENHBUF:1;
      unsigned SPIFE:1;
      unsigned MCLKEN:1;
      unsigned DISSCK:1;
      unsigned DISSDI:1;
      unsigned MSTEN:1;
      unsigned CKP:1;
      unsigned SSEN:1;
      unsigned CKE:1;
      unsigned SMP:1;
      unsigned MODE16:1;
      unsigned MODE32:1;
      unsigned DISSDO:1;
      unsigned SPISIDL:1;
      unsigned :1;
      unsigned SPIEN:1;
    };
    struct {
      unsigned :10;
      unsigned MODE:2;
    };
  };
} SPI3CON1BITS;
extern volatile SPI3CON1BITS SPI3CON1bits __attribute__((__sfr__));

#define SPI3CON1L SPI3CON1L
extern volatile unsigned int  SPI3CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1LBITS {
  union {
    struct {
      unsigned ENHBUF:1;
      unsigned SPIFE:1;
      unsigned MCLKEN:1;
      unsigned DISSCK:1;
      unsigned DISSDI:1;
      unsigned MSTEN:1;
      unsigned CKP:1;
      unsigned SSEN:1;
      unsigned CKE:1;
      unsigned SMP:1;
      unsigned MODE16:1;
      unsigned MODE32:1;
      unsigned DISSDO:1;
      unsigned SPISIDL:1;
      unsigned :1;
      unsigned SPIEN:1;
    };
    struct {
      unsigned :10;
      unsigned MODE:2;
    };
  };
} SPI3CON1LBITS;
extern volatile SPI3CON1LBITS SPI3CON1Lbits __attribute__((__sfr__));

#define SPI3CON1H SPI3CON1H
extern volatile unsigned int  SPI3CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1HBITS {
  union {
    struct {
      unsigned FRMCNT:3;
      unsigned FRMSYPW:1;
      unsigned MSSEN:1;
      unsigned FRMPOL:1;
      unsigned FRMSYNC:1;
      unsigned FRMEN:1;
      unsigned AUDMOD:2;
      unsigned URDTEN:1;
      unsigned AUDMONO:1;
      unsigned IGNTUR:1;
      unsigned IGNROV:1;
      unsigned SPISGNEXT:1;
      unsigned AUDEN:1;
    };
    struct {
      unsigned FRMCNT0:1;
      unsigned FRMCNT1:1;
      unsigned FRMCNT2:1;
      unsigned :5;
      unsigned AUDMOD0:1;
      unsigned AUDMOD1:1;
    };
  };
} SPI3CON1HBITS;
extern volatile SPI3CON1HBITS SPI3CON1Hbits __attribute__((__sfr__));

