Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA202.h
#define _CRYCONL_OPMOD1_POSITION                 0x00000005
#define _CRYCONL_OPMOD1_MASK                     0x00000020
#define _CRYCONL_OPMOD1_LENGTH                   0x00000001

#define _CRYCONL_OPMOD2_POSITION                 0x00000006
#define _CRYCONL_OPMOD2_MASK                     0x00000040
#define _CRYCONL_OPMOD2_LENGTH                   0x00000001

#define _CRYCONL_OPMOD3_POSITION                 0x00000007
#define _CRYCONL_OPMOD3_MASK                     0x00000080
#define _CRYCONL_OPMOD3_LENGTH                   0x00000001

#define _CRYCON2_KEYSRC_POSITION                 0x00000000
#define _CRYCON2_KEYSRC_MASK                     0x0000000F
#define _CRYCON2_KEYSRC_LENGTH                   0x00000004

#define _CRYCON2_KEYMOD_POSITION                 0x00000005
#define _CRYCON2_KEYMOD_MASK                     0x00000060
#define _CRYCON2_KEYMOD_LENGTH                   0x00000002

#define _CRYCON2_SKEYSEL_POSITION                0x00000007
#define _CRYCON2_SKEYSEL_MASK                    0x00000080
#define _CRYCON2_SKEYSEL_LENGTH                  0x00000001

#define _CRYCON2_CTRSIZE_POSITION                0x00000008
#define _CRYCON2_CTRSIZE_MASK                    0x00007F00
#define _CRYCON2_CTRSIZE_LENGTH                  0x00000007

#define _CRYCON2_KEYSRC0_POSITION                0x00000000
#define _CRYCON2_KEYSRC0_MASK                    0x00000001
#define _CRYCON2_KEYSRC0_LENGTH                  0x00000001

#define _CRYCON2_KEYSRC1_POSITION                0x00000001
#define _CRYCON2_KEYSRC1_MASK                    0x00000002
#define _CRYCON2_KEYSRC1_LENGTH                  0x00000001

#define _CRYCON2_KEYSRC2_POSITION                0x00000002
#define _CRYCON2_KEYSRC2_MASK                    0x00000004
#define _CRYCON2_KEYSRC2_LENGTH                  0x00000001

#define _CRYCON2_KEYSRC3_POSITION                0x00000003
#define _CRYCON2_KEYSRC3_MASK                    0x00000008
#define _CRYCON2_KEYSRC3_LENGTH                  0x00000001

#define _CRYCON2_KEYMOD0_POSITION                0x00000005
#define _CRYCON2_KEYMOD0_MASK                    0x00000020
#define _CRYCON2_KEYMOD0_LENGTH                  0x00000001

#define _CRYCON2_KEYMOD1_POSITION                0x00000006
#define _CRYCON2_KEYMOD1_MASK                    0x00000040
#define _CRYCON2_KEYMOD1_LENGTH                  0x00000001

#define _CRYCON2_CTRSIZE0_POSITION               0x00000008
#define _CRYCON2_CTRSIZE0_MASK                   0x00000100
#define _CRYCON2_CTRSIZE0_LENGTH                 0x00000001

#define _CRYCON2_CTRSIZE1_POSITION               0x00000009
#define _CRYCON2_CTRSIZE1_MASK                   0x00000200
#define _CRYCON2_CTRSIZE1_LENGTH                 0x00000001

#define _CRYCON2_CTRSIZE2_POSITION               0x0000000A
#define _CRYCON2_CTRSIZE2_MASK                   0x00000400
#define _CRYCON2_CTRSIZE2_LENGTH                 0x00000001

#define _CRYCON2_CTRSIZE3_POSITION               0x0000000B
#define _CRYCON2_CTRSIZE3_MASK                   0x00000800
#define _CRYCON2_CTRSIZE3_LENGTH                 0x00000001

#define _CRYCON2_CTRSIZE4_POSITION               0x0000000C
#define _CRYCON2_CTRSIZE4_MASK                   0x00001000
#define _CRYCON2_CTRSIZE4_LENGTH                 0x00000001

#define _CRYCON2_CTRSIZE5_POSITION               0x0000000D
#define _CRYCON2_CTRSIZE5_MASK                   0x00002000
#define _CRYCON2_CTRSIZE5_LENGTH                 0x00000001

#define _CRYCON2_CTRSIZE6_POSITION               0x0000000E
#define _CRYCON2_CTRSIZE6_MASK                   0x00004000
#define _CRYCON2_CTRSIZE6_LENGTH                 0x00000001

#define _CRYCONH_KEYSRC_POSITION                 0x00000000
#define _CRYCONH_KEYSRC_MASK                     0x0000000F
#define _CRYCONH_KEYSRC_LENGTH                   0x00000004

#define _CRYCONH_KEYMOD_POSITION                 0x00000005
#define _CRYCONH_KEYMOD_MASK                     0x00000060
#define _CRYCONH_KEYMOD_LENGTH                   0x00000002

#define _CRYCONH_SKEYSEL_POSITION                0x00000007
#define _CRYCONH_SKEYSEL_MASK                    0x00000080
#define _CRYCONH_SKEYSEL_LENGTH                  0x00000001

#define _CRYCONH_CTRSIZE_POSITION                0x00000008
#define _CRYCONH_CTRSIZE_MASK                    0x00007F00
#define _CRYCONH_CTRSIZE_LENGTH                  0x00000007

#define _CRYCONH_KEYSRC0_POSITION                0x00000000
#define _CRYCONH_KEYSRC0_MASK                    0x00000001
#define _CRYCONH_KEYSRC0_LENGTH                  0x00000001

#define _CRYCONH_KEYSRC1_POSITION                0x00000001
#define _CRYCONH_KEYSRC1_MASK                    0x00000002
#define _CRYCONH_KEYSRC1_LENGTH                  0x00000001

#define _CRYCONH_KEYSRC2_POSITION                0x00000002
#define _CRYCONH_KEYSRC2_MASK                    0x00000004
#define _CRYCONH_KEYSRC2_LENGTH                  0x00000001

#define _CRYCONH_KEYSRC3_POSITION                0x00000003
#define _CRYCONH_KEYSRC3_MASK                    0x00000008
#define _CRYCONH_KEYSRC3_LENGTH                  0x00000001

#define _CRYCONH_KEYMOD0_POSITION                0x00000005
#define _CRYCONH_KEYMOD0_MASK                    0x00000020
#define _CRYCONH_KEYMOD0_LENGTH                  0x00000001

#define _CRYCONH_KEYMOD1_POSITION                0x00000006
#define _CRYCONH_KEYMOD1_MASK                    0x00000040
#define _CRYCONH_KEYMOD1_LENGTH                  0x00000001

#define _CRYCONH_CTRSIZE0_POSITION               0x00000008
#define _CRYCONH_CTRSIZE0_MASK                   0x00000100
#define _CRYCONH_CTRSIZE0_LENGTH                 0x00000001

#define _CRYCONH_CTRSIZE1_POSITION               0x00000009
#define _CRYCONH_CTRSIZE1_MASK                   0x00000200
#define _CRYCONH_CTRSIZE1_LENGTH                 0x00000001

#define _CRYCONH_CTRSIZE2_POSITION               0x0000000A
#define _CRYCONH_CTRSIZE2_MASK                   0x00000400
#define _CRYCONH_CTRSIZE2_LENGTH                 0x00000001

#define _CRYCONH_CTRSIZE3_POSITION               0x0000000B
#define _CRYCONH_CTRSIZE3_MASK                   0x00000800
#define _CRYCONH_CTRSIZE3_LENGTH                 0x00000001

#define _CRYCONH_CTRSIZE4_POSITION               0x0000000C
#define _CRYCONH_CTRSIZE4_MASK                   0x00001000
#define _CRYCONH_CTRSIZE4_LENGTH                 0x00000001

#define _CRYCONH_CTRSIZE5_POSITION               0x0000000D
#define _CRYCONH_CTRSIZE5_MASK                   0x00002000
#define _CRYCONH_CTRSIZE5_LENGTH                 0x00000001

#define _CRYCONH_CTRSIZE6_POSITION               0x0000000E
#define _CRYCONH_CTRSIZE6_MASK                   0x00004000
#define _CRYCONH_CTRSIZE6_LENGTH                 0x00000001

#define _CRYSTAT_PGMFAIL_POSITION                0x00000000
#define _CRYSTAT_PGMFAIL_MASK                    0x00000001
#define _CRYSTAT_PGMFAIL_LENGTH                  0x00000001

#define _CRYSTAT_KEYFAIL_POSITION                0x00000001
#define _CRYSTAT_KEYFAIL_MASK                    0x00000002
#define _CRYSTAT_KEYFAIL_LENGTH                  0x00000001

#define _CRYSTAT_MODFAIL_POSITION                0x00000002
#define _CRYSTAT_MODFAIL_MASK                    0x00000004
#define _CRYSTAT_MODFAIL_LENGTH                  0x00000001

#define _CRYSTAT_ROLLOVR_POSITION                0x00000004
#define _CRYSTAT_ROLLOVR_MASK                    0x00000010
#define _CRYSTAT_ROLLOVR_LENGTH                  0x00000001

#define _CRYSTAT_CRYABRT_POSITION                0x00000005
#define _CRYSTAT_CRYABRT_MASK                    0x00000020
#define _CRYSTAT_CRYABRT_LENGTH                  0x00000001

